tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1704_tdd.h
#define DC1B0                         522
#define CCP1X                         523
#define DC1B1                         524
#define CCPR2L                        525
#define CCPR2H                        526
#define CCP2CON                       527
#define CCP2M                         528
#define CCP2M0                        529
#define CCP2M1                        530
#define CCP2M2                        531
#define CCP2M3                        532
#define DC2B0                         533
#define CCP2Y                         534
#define DC2B                          535
#define DC2B1                         536
#define CCP2X                         537
#define CCPTMRS                       538
#define C1TSEL0                       539
#define C1TSEL                        540
#define C1TSEL1                       541
#define C2TSEL0                       542
#define C2TSEL                        543
#define C2TSEL1                       544
#define P3TSEL                        545
#define P3TSEL0                       546
#define P3TSEL1                       547
#define P4TSEL0                       548
#define P4TSEL                        549
#define P4TSEL1                       550
#define SLRCONA                       551
#define SLRA0                         552
#define SLRA1                         553
#define SLRA2                         554
#define SLRA4                         555
#define SLRA5                         556
#define SLRCONC                       557
#define SLRC0                         558
#define SLRC1                         559
#define SLRC2                         560
#define SLRC3                         561
#define SLRC4                         562
#define SLRC5                         563
#define INLVLA                        564
#define INLVLA0                       565
#define INLVLA1                       566
#define INLVLA2                       567
#define INLVLA3                       568
#define INLVLA4                       569
#define INLVLA5                       570
#define INLVLC                        571
#define INLVLC0                       572
#define INLVLC1                       573
#define INLVLC2                       574
#define INLVLC3                       575
#define INLVLC4                       576
#define INLVLC5                       577
#define IOCAP                         578
#define IOCAP0                        579
#define IOCAP1                        580
#define IOCAP2                        581
#define IOCAP3                        582
#define IOCAP4                        583
#define IOCAP5                        584
#define IOCAN                         585
#define IOCAN0                        586
#define IOCAN1                        587
#define IOCAN2                        588
#define IOCAN3                        589
#define IOCAN4                        590
#define IOCAN5                        591
#define IOCAF                         592
#define IOCAF0                        593
#define IOCAF1                        594
#define IOCAF2                        595
#define IOCAF3                        596
#define IOCAF4                        597
#define IOCAF5                        598
#define IOCCP                         599
#define IOCCP0                        600
#define IOCCP1                        601
#define IOCCP2                        602
#define IOCCP3                        603
#define IOCCP4                        604
#define IOCCP5                        605
#define IOCCN                         606
#define IOCCN0                        607
#define IOCCN1                        608
#define IOCCN2                        609
#define IOCCN3                        610
#define IOCCN4                        611
#define IOCCN5                        612
#define IOCCF                         613
#define IOCCF0                        614
#define IOCCF1                        615
#define IOCCF2                        616
#define IOCCF3                        617
#define IOCCF4                        618
#define IOCCF5                        619
#define TMR4                          620
#define PR4                           621
#define T4CON                         622
#define T4CKPS0                       623
#define T4CKPS                        624
#define T4CKPS1                       625
#define TMR4ON                        626
#define T4OUTPS                       627
#define T4OUTPS0                      628
#define T4OUTPS1                      629
#define T4OUTPS2                      630
#define T4OUTPS3                      631
#define TMR6                          632
#define PR6                           633
#define T6CON                         634
#define T6CKPS0                       635
#define T6CKPS                        636
#define T6CKPS1                       637
#define TMR6ON                        638
#define T6OUTPS0                      639
#define T6OUTPS                       640
#define T6OUTPS1                      641
#define T6OUTPS2                      642
#define T6OUTPS3                      643
#define OPA1CON                       644
#define OPA1PCH                       645
#define OPA1PCH0                      646
#define OPA1PCH1                      647
#define OPA1UG                        648
#define OPA1SP                        649
#define OPA1EN                        650
#define OPA2CON                       651
#define OPA2PCH                       652
#define OPA2PCH0                      653
#define OPA2PCH1                      654
#define OPA2UG                        655
#define OPA2SP                        656
#define OPA2EN                        657
#define PWM3DCL0                      658
#define PWM3DCL                       659
#define PWM3DCL1                      660
#define PWM3DCH0                      661
#define PWM3DCH                       662
#define PWM3DCH1                      663
#define PWM3DCH2                      664
#define PWM3DCH3                      665
#define PWM3DCH4                      666
#define PWM3DCH5                      667
#define PWM3DCH6                      668
#define PWM3DCH7                      669
#define PWM3CON                       670
#define PWM3POL                       671
#define PWM3OUT                       672
#define PWM3EN                        673
#define PWM4DCL                       674
#define PWM4DCL0                      675
#define PWM4DCL1                      676
#define PWM4DCH0                      677
#define PWM4DCH                       678
#define PWM4DCH1                      679
#define PWM4DCH2                      680
#define PWM4DCH3                      681
#define PWM4DCH4                      682
#define PWM4DCH5                      683
#define PWM4DCH6                      684
#define PWM4DCH7                      685
#define PWM4CON                       686
#define PWM4POL                       687
#define PWM4OUT                       688
#define PWM4EN                        689
#define COG1PHR                       690
#define G1PHR                         691
#define G1PHR0                        692
#define G1PHR1                        693
#define G1PHR2                        694
#define G1PHR3                        695
#define G1PHR4                        696
#define G1PHR5                        697
#define COG1PHF                       698
#define G1PHF0                        699
#define G1PHF                         700
#define G1PHF1                        701
#define G1PHF2                        702
#define G1PHF3                        703
#define G1PHF4                        704
#define G1PHF5                        705
#define COG1BLKR                      706
#define G1BLKR                        707
#define G1BLKR0                       708
#define G1BLKR1                       709
#define G1BLKR2                       710
#define G1BLKR3                       711
#define G1BLKR4                       712
#define G1BLKR5                       713
#define COG1BLKF                      714
#define G1BLKF                        715
#define G1BLKF0                       716
#define G1BLKF1                       717
#define G1BLKF2                       718
#define G1BLKF3                       719
#define G1BLKF4                       720
#define G1BLKF5                       721
#define COG1DBR                       722
#define G1DBR0                        723
#define G1DBR                         724
#define G1DBR1                        725
#define G1DBR2                        726
#define G1DBR3                        727
#define G1DBR4                        728
#define G1DBR5                        729
#define COG1DBF                       730
#define G1DBF0                        731
#define G1DBF                         732
#define G1DBF1                        733
#define G1DBF2                        734
#define G1DBF3                        735
#define G1DBF4                        736
#define G1DBF5                        737
#define COG1CON0                      738
#define G1MD0                         739
#define G1MD                          740
#define G1MD1                         741
#define G1MD2                         742
#define G1CS0                         743
#define G1CS                          744
#define G1CS1                         745
#define G1LD                          746
#define G1EN                          747
#define COG1CON1                      748
#define G1POLA                        749
#define G1POLB                        750
#define G1POLC                        751
#define G1POLD                        752
#define G1FDBS                        753
#define G1RDBS                        754
#define COG1RIS                       755
#define G1RIS0                        756
#define G1RIS1                        757
#define G1RIS2                        758
#define G1RIS3                        759
#define G1RIS4                        760
#define G1RIS5                        761
#define G1RIS6                        762
#define COG1RSIM                      763
#define G1RSIM0                       764
#define G1RSIM1                       765
#define G1RSIM2                       766
#define G1RSIM3                       767
#define G1RSIM4                       768
#define G1RSIM5                       769
#define G1RSIM6                       770
#define COG1FIS                       771
#define G1FIS0                        772
#define G1FIS1                        773
#define G1FIS2                        774
#define G1FIS3                        775
#define G1FIS4                        776
#define G1FIS5                        777
#define G1FIS6                        778
#define COG1FSIM                      779
#define G1FSIM0                       780
#define G1FSIM1                       781
#define G1FSIM2                       782
#define G1FSIM3                       783
#define G1FSIM4                       784
#define G1FSIM5                       785
#define G1FSIM6                       786
#define COG1ASD0                      787
#define G1ASDAC0                      788
#define G1ASDAC                       789
#define G1ASDAC1                      790
#define G1ASDBD0                      791
#define G1ASDBD                       792
#define G1ASDBD1                      793
#define G1ARSEN                       794
#define G1ASE                         795
#define COG1ASD1                      796
#define G1AS0E                        797
#define G1AS1E                        798
#define G1AS2E                        799
#define G1AS3E                        800
#define COG1STR                       801
#define G1STRA                        802
#define G1STRB                        803
#define G1STRC                        804
#define G1STRD                        805
#define G1SDATA                       806
#define G1SDATB                       807
#define G1SDATC                       808
#define G1SDATD                       809
#define PPSLOCK                       810
#define PPSLOCKED                     811
#define INTPPS                        812
#define T0CKIPPS                      813
#define T1CKIPPS                      814
#define T1GPPS                        815
#define CCP1PPS                       816
#define CCP2PPS                       817
#define COGINPPS                      818
#define SSPCLKPPS                     819
#define SSPDATPPS                     820
#define SSPSSPPS                      821
#define RXPPS                         822
#define CKPPS                         823
#define CLCIN0PPS                     824
#define CLCIN1PPS                     825
#define CLCIN2PPS                     826
#define CLCIN3PPS                     827
#define RA0PPS                        828
#define RA1PPS                        829
#define RA2PPS                        830
#define RA4PPS                        831
#define RA5PPS                        832
#define RC0PPS                        833
#define RC1PPS                        834
#define RC2PPS                        835
#define RC3PPS                        836
#define RC4PPS                        837
#define RC5PPS                        838
#define CLCDATA                       839
#define MCLC1OUT                      840
#define MCLC2OUT                      841
#define MCLC3OUT                      842
#define CLC1CON                       843
#define CLC1CON_MODE                  844
#define LC1MODE0                      845
#define LC1MODE                       846
#define CLC1CON_MODE0                 847
#define LC1MODE1                      848
#define CLC1CON_MODE1                 849
#define CLC1CON_MODE2                 850
#define LC1MODE2                      851
#define LC1INTN                       852
#define CLC1CON_INTN                  853
#define LC1INTP                       854
#define CLC1CON_INTP                  855
#define CLC1CON_OUT                   856
#define LC1OUT                        857
#define LC1EN                         858
#define CLC1CON_EN                    859
#define CLC1POL                       860
#define LC1G1POL                      861
#define CLC1POL_G1POL                 862
#define CLC1POL_G2POL                 863
#define LC1G2POL                      864
#define LC1G3POL                      865
#define CLC1POL_G3POL                 866
#define LC1G4POL                      867
#define CLC1POL_G4POL                 868
#define CLC1POL_POL                   869
#define LC1POL                        870
#define CLC1SEL0                      871
#define CLC1SEL0_D1S0                 872
#define LC1D1S                        873
#define LC1D1S0                       874
#define CLC1SEL0_D1S                  875
#define CLC1SEL0_D1S1                 876
#define LC1D1S1                       877
#define CLC1SEL0_D1S2                 878
#define LC1D1S2                       879
#define CLC1SEL0_D1S3                 880
#define LC1D1S3                       881
#define CLC1SEL0_D1S4                 882
#define LC1D1S4                       883
#define CLC1SEL1                      884
#define CLC1SEL1_D2S0                 885
#define CLC1SEL1_D2S                  886
#define LC1D2S                        887
#define LC1D2S0                       888
#define CLC1SEL1_D2S1                 889
#define LC1D2S1                       890
#define LC1D2S2                       891
#define CLC1SEL1_D2S2                 892
#define LC1D2S3                       893
#define CLC1SEL1_D2S3                 894
#define LC1D2S4                       895
#define CLC1SEL1_D2S4                 896
#define CLC1SEL2                      897
#define LC1D3S0                       898
#define CLC1SEL2_D3S                  899
#define LC1D3S                        900
#define CLC1SEL2_D3S0                 901
#define LC1D3S1                       902
#define CLC1SEL2_D3S1                 903
#define LC1D3S2                       904
#define CLC1SEL2_D3S2                 905
#define LC1D3S3                       906
#define CLC1SEL2_D3S3                 907
#define LC1D3S4                       908
#define CLC1SEL2_D3S4                 909
#define CLC1SEL3                      910
#define CLC1SEL3_D4S                  911
#define LC1D4S                        912
#define LC1D4S0                       913
#define CLC1SEL3_D4S0                 914
#define CLC1SEL3_D4S1                 915
#define LC1D4S1                       916
#define LC1D4S2                       917
#define CLC1SEL3_D4S2                 918
#define LC1D4S3                       919
#define CLC1SEL3_D4S3                 920
#define LC1D4S4                       921
#define CLC1SEL3_D4S4                 922
#define CLC1GLS0                      923
#define CLC1GLS0_D1N                  924
#define LC1G1D1N                      925
#define CLC1GLS0_D1T                  926
#define LC1G1D1T                      927
#define LC1G1D2N                      928
#define CLC1GLS0_D2N                  929
#define LC1G1D2T                      930
#define CLC1GLS0_D2T                  931
#define CLC1GLS0_D3N                  932
#define LC1G1D3N                      933
#define CLC1GLS0_D3T                  934
#define LC1G1D3T                      935
#define CLC1GLS0_D4N                  936
#define LC1G1D4N                      937
#define CLC1GLS0_D4T                  938
#define LC1G1D4T                      939
#define CLC1GLS1                      940
#define CLC1GLS1_D1N                  941
#define LC1G2D1N                      942
#define LC1G2D1T                      943
#define CLC1GLS1_D1T                  944
#define CLC1GLS1_D2N                  945
#define LC1G2D2N                      946
#define LC1G2D2T                      947
#define CLC1GLS1_D2T                  948
#define CLC1GLS1_D3N                  949
#define LC1G2D3N                      950
#define LC1G2D3T                      951
#define CLC1GLS1_D3T                  952
#define CLC1GLS1_D4N                  953
#define LC1G2D4N                      954
#define LC1G2D4T                      955
#define CLC1GLS1_D4T                  956
#define CLC1GLS2                      957
#define CLC1GLS2_D1N                  958
#define LC1G3D1N                      959
#define LC1G3D1T                      960
#define CLC1GLS2_D1T                  961
#define LC1G3D2N                      962
#define CLC1GLS2_D2N                  963
#define LC1G3D2T                      964
#define CLC1GLS2_D2T                  965
#define CLC1GLS2_D3N                  966
#define LC1G3D3N                      967
#define LC1G3D3T                      968
#define CLC1GLS2_D3T                  969
#define LC1G3D4N                      970
#define CLC1GLS2_D4N                  971
#define LC1G3D4T                      972
#define CLC1GLS2_D4T                  973
#define CLC1GLS3                      974
#define LC1G4D1N                      975
#define CLC1GLS3_G4D1N                976
#define LC1G4D1T                      977
#define CLC1GLS3_G4D1T                978
#define CLC1GLS3_G4D2N                979
#define LC1G4D2N                      980
#define CLC1GLS3_G4D2T                981
#define LC1G4D2T                      982
#define LC1G4D3N                      983
#define CLC1GLS3_G4D3N                984
#define LC1G4D3T                      985
#define CLC1GLS3_G4D3T                986
#define CLC1GLS3_G4D4N                987
#define LC1G4D4N                      988
#define CLC1GLS3_G4D4T                989
#define LC1G4D4T                      990
#define CLC2CON                       991
#define LC2MODE0                      992
#define CLC2CON_MODE                  993
#define LC2MODE                       994
#define CLC2CON_MODE0                 995
#define LC2MODE1                      996
#define CLC2CON_MODE1                 997
#define LC2MODE2                      998
#define CLC2CON_MODE2                 999
#define LC2INTN                       1000
#define CLC2CON_INTN                  1001
#define LC2INTP                       1002
#define CLC2CON_INTP                  1003
#define CLC2CON_OUT                   1004
#define LC2OUT                        1005
#define CLC2CON_EN                    1006
#define LC2EN                         1007
#define CLC2POL                       1008
#define LC2G1POL                      1009
#define CLC2POL_G1POL                 1010
#define LC2G2POL                      1011
#define CLC2POL_G2POL                 1012
#define LC2G3POL                      1013
#define CLC2POL_G3POL                 1014
#define LC2G4POL                      1015
#define CLC2POL_G4POL                 1016
#define CLC2POL_POL                   1017
#define LC2POL                        1018
#define CLC2SEL0                      1019
#define CLC2SEL0_D1S                  1020
#define LC2D1S0                       1021
#define CLC2SEL0_D1S0                 1022
#define LC2D1S                        1023
#define LC2D1S1                       1024
#define CLC2SEL0_D1S1                 1025
#define LC2D1S2                       1026
#define CLC2SEL0_D1S2                 1027
#define CLC2SEL0_D1S3                 1028
#define LC2D1S3                       1029
#define LC2D1S4                       1030
#define CLC2SEL0_D1S4                 1031
#define CLC2SEL1                      1032
#define LC2D2S0                       1033
#define CLC2SEL1_D2S0                 1034
#define LC2D2S                        1035
#define CLC2SEL1_D2S                  1036
#define LC2D2S1                       1037
#define CLC2SEL1_D2S1                 1038
#define LC2D2S2                       1039
#define CLC2SEL1_D2S2                 1040
#define LC2D2S3                       1041
#define CLC2SEL1_D2S3                 1042
#define LC2D2S4                       1043
#define CLC2SEL1_D2S4                 1044
#define CLC2SEL2                      1045
#define CLC2SEL2_D3S                  1046
#define LC2D3S0                       1047
#define CLC2SEL2_D3S0                 1048
#define LC2D3S                        1049
#define CLC2SEL2_D3S1                 1050
#define LC2D3S1                       1051
#define LC2D3S2                       1052
#define CLC2SEL2_D3S2                 1053
#define LC2D3S3                       1054
#define CLC2SEL2_D3S3                 1055
#define LC2D3S4                       1056
#define CLC2SEL2_D3S4                 1057
#define CLC2SEL3                      1058
#define LC2D4S                        1059
#define LC2D4S0                       1060
#define CLC2SEL3_D4S                  1061
#define CLC2SEL3_D4S0                 1062
#define LC2D4S1                       1063
#define CLC2SEL3_D4S1                 1064
#define LC2D4S2                       1065
#define CLC2SEL3_D4S2                 1066
#define CLC2SEL3_D4S3                 1067
#define LC2D4S3                       1068
#define LC2D4S4                       1069
#define CLC2SEL3_D4S4                 1070
#define CLC2GLS0                      1071
#define LC2G1D1N                      1072
#define CLC2GLS0_D1N                  1073
#define CLC2GLS0_D1T                  1074
#define LC2G1D1T                      1075
#define LC2G1D2N                      1076
#define CLC2GLS0_D2N                  1077
#define CLC2GLS0_D2T                  1078
#define LC2G1D2T                      1079
#define LC2G1D3N                      1080
#define CLC2GLS0_D3N                  1081
#define CLC2GLS0_D3T                  1082
#define LC2G1D3T                      1083
#define LC2G1D4N                      1084
#define CLC2GLS0_D4N                  1085
#define CLC2GLS0_D4T                  1086
#define LC2G1D4T                      1087
#define CLC2GLS1                      1088
#define CLC2GLS1_D1N                  1089
#define LC2G2D1N                      1090
