tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1704_tdd.h
#define CLC2GLS1_D1T                  1091
#define LC2G2D1T                      1092
#define CLC2GLS1_D2N                  1093
#define LC2G2D2N                      1094
#define CLC2GLS1_D2T                  1095
#define LC2G2D2T                      1096
#define LC2G2D3N                      1097
#define CLC2GLS1_D3N                  1098
#define LC2G2D3T                      1099
#define CLC2GLS1_D3T                  1100
#define LC2G2D4N                      1101
#define CLC2GLS1_D4N                  1102
#define LC2G2D4T                      1103
#define CLC2GLS1_D4T                  1104
#define CLC2GLS2                      1105
#define LC2G3D1N                      1106
#define CLC2GLS2_D1N                  1107
#define CLC2GLS2_D1T                  1108
#define LC2G3D1T                      1109
#define CLC2GLS2_D2N                  1110
#define LC2G3D2N                      1111
#define LC2G3D2T                      1112
#define CLC2GLS2_D2T                  1113
#define CLC2GLS2_D3N                  1114
#define LC2G3D3N                      1115
#define CLC2GLS2_D3T                  1116
#define LC2G3D3T                      1117
#define CLC2GLS2_D4N                  1118
#define LC2G3D4N                      1119
#define LC2G3D4T                      1120
#define CLC2GLS2_D4T                  1121
#define CLC2GLS3                      1122
#define LC2G4D1N                      1123
#define CLC2GLS3_G4D1N                1124
#define CLC2GLS3_G4D1T                1125
#define LC2G4D1T                      1126
#define CLC2GLS3_G4D2N                1127
#define LC2G4D2N                      1128
#define LC2G4D2T                      1129
#define CLC2GLS3_G4D2T                1130
#define CLC2GLS3_G4D3N                1131
#define LC2G4D3N                      1132
#define CLC2GLS3_G4D3T                1133
#define LC2G4D3T                      1134
#define LC2G4D4N                      1135
#define CLC2GLS3_G4D4N                1136
#define CLC2GLS3_G4D4T                1137
#define LC2G4D4T                      1138
#define CLC3CON                       1139
#define LC3MODE0                      1140
#define CLC3CON_MODE0                 1141
#define CLC3CON_MODE                  1142
#define LC3MODE                       1143
#define LC3MODE1                      1144
#define CLC3CON_MODE1                 1145
#define LC3MODE2                      1146
#define CLC3CON_MODE2                 1147
#define LC3INTN                       1148
#define CLC3CON_INTN                  1149
#define CLC3CON_INTP                  1150
#define LC3INTP                       1151
#define CLC3CON_OUT                   1152
#define LC3OUT                        1153
#define LC3EN                         1154
#define CLC3CON_EN                    1155
#define CLC3POL                       1156
#define LC3G1POL                      1157
#define CLC3POL_G1POL                 1158
#define LC3G2POL                      1159
#define CLC3POL_G2POL                 1160
#define CLC3POL_G3POL                 1161
#define LC3G3POL                      1162
#define LC3G4POL                      1163
#define CLC3POL_G4POL                 1164
#define LC3POL                        1165
#define CLC3POL_POL                   1166
#define CLC3SEL0                      1167
#define CLC3SEL0_D1S0                 1168
#define LC3D1S0                       1169
#define LC3D1S                        1170
#define CLC3SEL0_D1S                  1171
#define LC3D1S1                       1172
#define CLC3SEL0_D1S1                 1173
#define LC3D1S2                       1174
#define CLC3SEL0_D1S2                 1175
#define LC3D1S3                       1176
#define CLC3SEL0_D1S3                 1177
#define LC3D1S4                       1178
#define CLC3SEL0_D1S4                 1179
#define CLC3SEL1                      1180
#define CLC3SEL1_D2S                  1181
#define CLC3SEL1_D2S0                 1182
#define LC3D2S                        1183
#define LC3D2S0                       1184
#define CLC3SEL1_D2S1                 1185
#define LC3D2S1                       1186
#define CLC3SEL1_D2S2                 1187
#define LC3D2S2                       1188
#define CLC3SEL1_D2S3                 1189
#define LC3D2S3                       1190
#define LC3D2S4                       1191
#define CLC3SEL1_D2S4                 1192
#define CLC3SEL2                      1193
#define CLC3SEL2_D3S0                 1194
#define LC3D3S                        1195
#define CLC3SEL2_D3S                  1196
#define LC3D3S0                       1197
#define LC3D3S1                       1198
#define CLC3SEL2_D3S1                 1199
#define LC3D3S2                       1200
#define CLC3SEL2_D3S2                 1201
#define LC3D3S3                       1202
#define CLC3SEL2_D3S3                 1203
#define LC3D3S4                       1204
#define CLC3SEL2_D3S4                 1205
#define CLC3SEL3                      1206
#define CLC3SEL3_D4S0                 1207
#define LC3D4S0                       1208
#define LC3D4S                        1209
#define CLC3SEL3_D4S                  1210
#define LC3D4S1                       1211
#define CLC3SEL3_D4S1                 1212
#define LC3D4S2                       1213
#define CLC3SEL3_D4S2                 1214
#define LC3D4S3                       1215
#define CLC3SEL3_D4S3                 1216
#define LC3D4S4                       1217
#define CLC3SEL3_D4S4                 1218
#define CLC3GLS0                      1219
#define CLC3GLS0_D1N                  1220
#define LC3G1D1N                      1221
#define LC3G1D1T                      1222
#define CLC3GLS0_D1T                  1223
#define LC3G1D2N                      1224
#define CLC3GLS0_D2N                  1225
#define CLC3GLS0_D2T                  1226
#define LC3G1D2T                      1227
#define CLC3GLS0_D3N                  1228
#define LC3G1D3N                      1229
#define LC3G1D3T                      1230
#define CLC3GLS0_D3T                  1231
#define CLC3GLS0_D4N                  1232
#define LC3G1D4N                      1233
#define CLC3GLS0_D4T                  1234
#define LC3G1D4T                      1235
#define CLC3GLS1                      1236
#define LC3G2D1N                      1237
#define CLC3GLS1_D1N                  1238
#define CLC3GLS1_D1T                  1239
#define LC3G2D1T                      1240
#define LC3G2D2N                      1241
#define CLC3GLS1_D2N                  1242
#define LC3G2D2T                      1243
#define CLC3GLS1_D2T                  1244
#define LC3G2D3N                      1245
#define CLC3GLS1_D3N                  1246
#define CLC3GLS1_D3T                  1247
#define LC3G2D3T                      1248
#define LC3G2D4N                      1249
#define CLC3GLS1_D4N                  1250
#define LC3G2D4T                      1251
#define CLC3GLS1_D4T                  1252
#define CLC3GLS2                      1253
#define LC3G3D1N                      1254
#define CLC3GLS2_D1N                  1255
#define LC3G3D1T                      1256
#define CLC3GLS2_D1T                  1257
#define CLC3GLS2_D2N                  1258
#define LC3G3D2N                      1259
#define CLC3GLS2_D2T                  1260
#define LC3G3D2T                      1261
#define CLC3GLS2_D3N                  1262
#define LC3G3D3N                      1263
#define LC3G3D3T                      1264
#define CLC3GLS2_D3T                  1265
#define CLC3GLS2_D4N                  1266
#define LC3G3D4N                      1267
#define CLC3GLS2_D4T                  1268
#define LC3G3D4T                      1269
#define CLC3GLS3                      1270
#define LC3G4D1N                      1271
#define CLC3GLS3_G4D1N                1272
#define LC3G4D1T                      1273
#define CLC3GLS3_G4D1T                1274
#define LC3G4D2N                      1275
#define CLC3GLS3_G4D2N                1276
#define CLC3GLS3_G4D2T                1277
#define LC3G4D2T                      1278
#define LC3G4D3N                      1279
#define CLC3GLS3_G4D3N                1280
#define CLC3GLS3_G4D3T                1281
#define LC3G4D3T                      1282
#define LC3G4D4N                      1283
#define CLC3GLS3_G4D4N                1284
#define LC3G4D4T                      1285
#define CLC3GLS3_G4D4T                1286
#define STATUS_SHAD                   1287
#define C_SHAD                        1288
#define DC_SHAD                       1289
#define Z_SHAD                        1290
#define WREG_SHAD                     1291
#define BSR_SHAD                      1292
#define PCLATH_SHAD                   1293
#define FSR0L_SHAD                    1294
#define FSR0H_SHAD                    1295
#define FSR1L_SHAD                    1296
#define FSR1H_SHAD                    1297
#define STKPTR                        1298
#define TOSL                          1299
#define TOSH                          1300

#endif // _PIC16F1704_H_
